[
  {
    "": 0,
    "customer name": "Linda Hudson",
    "review": "I had been waiting for a particular dress to come back in stock, I emailed customer service about the dress and they informed me they had no plans to restock the size I wanted and advised me to buy it in another size or colour, I opted for one size bigger as I really love the style of the dress, mind you its not cheap at £225! Two days later the dress came back in stock!! I emailed customer service lady called Amina back and she advised me to buy the size and return the other one for a refund in case it sells out again! They don't offer exchanges so I tried to do a refund but there was no option on their returns portal for a refund as I had used a discount code, which they provided!! I am still within the 14 day window but customer service have stopped replying to my emails, now I'm stuck with a dress and cannot get a refund which I am legally entitled to! I have researched them on Companies House (registration number 12643861) and they were issued a final gazette notice and have been struck off companies house, effectively dissolving the business, so they are trading illegally.",
    "date": "17 June 2025",
    "link": "https://uk.trustpilot.com/reviews/685a693e365dbcd8533de81d",
    "rating": 1,
    "sentiment_score": 0.04019431089743589,
    "sentiment_label": "neutral",
    "issue_category": "delivery_issue, expectation",
    "matched_keywords": "refund, return, exchange, waiting"
  },
  {
    "": 1,
    "customer name": "Yemurai",
    "review": "I ordered a dress, it arrived on time, but due to personal reasons I was not able to return it within the 14 day window. I spoke to a customer service agent that advised that as a good will gesture they can accept a return within 21 days for store credit. I asked to begin the process, as i have no need for the dress, it's completely unworn with tags and labels. However, I was then informed that i had gone past the 21 day period as well, which makes no sense.\nUK law clearly states that the return window begins from the day that the goods are received (how are you legally able to count the return window before goods are received? I can't start returning something I don't have yet).\n\nI would have happily accepted a lesser refund since I was outside of the legislated 14 day window (not the non compliant company window).\n\nI do not fault the agent I spoke to, the companies policies are not right, especially if they are going to be trading internationally.\n\nVery disappointed.",
    "date": "14 April 2025",
    "link": "https://uk.trustpilot.com/reviews/67fcfb1e958a8895c884d65d",
    "rating": 1,
    "sentiment_score": 0.03265306122448979,
    "sentiment_label": "neutral",
    "issue_category": "expectation",
    "matched_keywords": "refund, return"
  },
  {
    "": 2,
    "customer name": "Carolina",
    "review": "I have never felt so compelled to leave a negative review, but my experience with BBXBRAND has been so poor, I believe it's important to share it with others.\n\nI purchased two items from BBXBRAND, and both arrived damaged. I followed their return process and sent both items back promptly. However, since then, I have had to chase the company repeatedly for any updates on my refund. Despite multiple attempts to reach them, I have yet to receive any meaningful response or resolution.\n\nBBXBRAND has failed to meet its legal obligations under UK consumer protection laws, specifically the Consumer Rights Act 2015. This legislation entitles me to a full refund for faulty goods, yet BBXBRAND continues to avoid fulfilling this obligation, leaving me out of pocket.\n\nTheir on/off responses and complete disregard for customer satisfaction are deeply concerning. The lack of transparency and accountability in handling customer complaints is nothing short of unprofessional.\n\nI strongly urge anyone considering purchasing from BBXBRAND to think twice. If you encounter any issues with your order, expect a frustrating and time-consuming battle to get any resolution. Based on my experience, I cannot recommend this company.\n\nAt this stage, I am left with no choice but to pursue further action to recover my refund, as BBXBRAND continues to ignore its obligations under UK law.\n\nUpdate: After posting this review, I would expect BBXBRAND to take action immediately, but given their track record, I remain doubtful.",
    "date": "09 April 2025",
    "link": "https://uk.trustpilot.com/reviews/67f6b0a64b0bf476d58378b9",
    "rating": 1,
    "sentiment_score": -0.011403508771929825,
    "sentiment_label": "neutral",
    "issue_category": "product_issue, expectation",
    "matched_keywords": "refund, return, short"
  },
  {
    "": 3,
    "customer name": "Kassandra Mitchell",
    "review": "Dodgy Company, Provided a discount code via email urging me to proceed with order but no mention that if I order using the code I would be unable to return the items (I also had 2 warnings from friends prior to ordering and I ignored so that’s my fault)",
    "date": "13 February 2025",
    "link": "https://uk.trustpilot.com/reviews/67bf0de2f2e8e089eb49ad28",
    "rating": 1,
    "sentiment_score": -0.25,
    "sentiment_label": "negative",
    "issue_category": "service_issue, expectation",
    "matched_keywords": "return, ignored"
  },
  {
    "": 4,
    "customer name": "melek",
    "review": "I returned an item within the legal timeframe and was issued store credit instead of a refund, despite my rights under the Consumer Contracts Regulations. This was over a 10% discount code, and I still kept one dress, as I was weighing my options for my birthday—so I had still spent a respectable amount with them.\n\nWhen I raised this, I was met with misleading claims and accusations. Fortunately, my bank refunded me, but the process was unnecessarily difficult. A brand aiming to project a luxury aesthetic should prioritize customer trust over short-term profits. Be cautious if you ever need to return something.",
    "date": "13 February 2025",
    "link": "https://uk.trustpilot.com/reviews/67adfbc1f48b4fe3d05fd790",
    "rating": 1,
    "sentiment_score": 0.1,
    "sentiment_label": "neutral",
    "issue_category": "product_issue, expectation",
    "matched_keywords": "refund, return, short, fit"
  },
  {
    "": 5,
    "customer name": "Laura",
    "review": "Returned item on 26th November bbxbrand have not refunded my return despite proof of delivery there’s a photo of it sitting in there office it has been signed for, first they said would have to take store credit note because I used discount code but I know my legal right as an online buyer you do not have to accept a store credit as long as it is within 14 days it’s only in store they can make you take store credit note. 9 weeks later still no refund or store credit despite weeks of me sending messages in my mind this is stealing at this point knowingly not giving someone there money back when they have shown you photos of my return sitting in your office really unfair and unprofessional.",
    "date": "26 November 2024",
    "link": "https://uk.trustpilot.com/reviews/679a8d5db0794f4cc9e912ec",
    "rating": 1,
    "sentiment_score": 0.023214285714285715,
    "sentiment_label": "neutral",
    "issue_category": "expectation",
    "matched_keywords": "refund, return"
  },
  {
    "": 6,
    "customer name": "Laxmi Gautam",
    "review": "Exchanging sizes was straightforward. Communication during the return process was clear and fast.",
    "date": "30 December 2024",
    "link": "https://uk.trustpilot.com/reviews/678b60bff83c8328e9a09ecf",
    "rating": 5,
    "sentiment_score": 0.225,
    "sentiment_label": "positive",
    "issue_category": "positive_experience, expectation",
    "matched_keywords": "return, fast"
  },
  {
    "": 7,
    "customer name": "Valeria Perez",
    "review": "I’ve been recommending BBXBRAND to all my friends. Every piece I’ve bought has been of outstanding quality, and their attention to detail is remarkable.",
    "date": "27 November 2024",
    "link": "https://uk.trustpilot.com/reviews/67687d5b3660cbce9f6bc0bd",
    "rating": 5,
    "sentiment_score": 0.625,
    "sentiment_label": "positive",
    "issue_category": "positive_experience",
    "matched_keywords": "outstanding"
  },
  {
    "": 8,
    "customer name": "Huda Al-Hinai",
    "review": "I’m very impressed with the durability of their clothes. After multiple washes, my top still looks as good as new.",
    "date": "13 November 2024",
    "link": "https://uk.trustpilot.com/reviews/6767b4bbcaec609d109bd27a",
    "rating": 5,
    "sentiment_score": 0.4672727272727273,
    "sentiment_label": "positive",
    "issue_category": "uncategorized",
    "matched_keywords": "none"
  },
  {
    "": 9,
    "customer name": "Lina Al-Qahtani",
    "review": "I purchased the 24' Shell Jacket for my winter trip, and it exceeded expectations. It kept me warm while being incredibly stylish. It pairs well with both casual and formal outfits. Delivery was prompt, and the packaging was neat and secure.",
    "date": "30 October 2024",
    "link": "https://uk.trustpilot.com/reviews/6763c6d62042b8d0ad1fdaa1",
    "rating": 5,
    "sentiment_score": 0.25,
    "sentiment_label": "positive",
    "issue_category": "product_issue",
    "matched_keywords": "fit"
  },
  {
    "": 10,
    "customer name": "Lala Ahmadova",
    "review": "The jumpsuit I wore to a wedding turned heads. It fit perfectly, looked stunning, and was so easy to move and dance in.",
    "date": "28 November 2024",
    "link": "https://uk.trustpilot.com/reviews/6758007680ef13feb97cbd01",
    "rating": 5,
    "sentiment_score": 0.5833333333333333,
    "sentiment_label": "positive",
    "issue_category": "product_issue",
    "matched_keywords": "fit"
  },
  {
    "": 11,
    "customer name": "junebugg the king",
    "review": "Website is really easy to navigate and all information is there if you look for it. I bought three items and I noticed one said pre order so I asked about it and the email back was quick and helpful. Would buy from them again",
    "date": "06 December 2024",
    "link": "https://uk.trustpilot.com/reviews/675777623e4192e2b4a48506",
    "rating": 5,
    "sentiment_score": 0.25555555555555554,
    "sentiment_label": "positive",
    "issue_category": "positive_experience",
    "matched_keywords": "quick, helpful"
  },
  {
    "": 12,
    "customer name": "Pene",
    "review": "Unfair practises and don’t care about customers. God awful customer service and the owner is just as rude as the staff. Ordered a dress for a wedding and missed the fact it was a pre-order dress because it’s written right at the bottom of the dress description section which is just stupid. Have they never heard of banners, stickers or labels?\nAnyway cancelled the order a few days later before the order had even been processed and was told I couldn’t get a refund because I had used a discount code. They would only give me a store credit which I insisted I didn’t want because I won’t be shopping here again. Only to be ignored. I also found out recently that the store credit only lasts 6 months lol so I’ve tried to make another order so I don’t lose my money but my order has been cancelled for whatever reason I don’t know.",
    "date": "08 October 2024",
    "link": "https://uk.trustpilot.com/reviews/6743a91ce3e472811308989e",
    "rating": 1,
    "sentiment_score": -0.14285714285714285,
    "sentiment_label": "negative",
    "issue_category": "service_issue, expectation",
    "matched_keywords": "refund, rude, ignored"
  },
  {
    "": 13,
    "customer name": "Marianne",
    "review": "I ordered a dress from this company all the way from the US. I reached out regarding receiving a return label as the items quality was not as expected at all and the customer service rep informed me that 1. return labels are not provided and 2. I was trying to return the item 2 days before the 14 day return window closed. Mind you… Return shipping is around $30 from the US back to the UK which is a percentage of what I paid for the dress and I LIVE IN THE US. The norm is an 30day window for returns, so their policy is absolutely rubbish.\n\nSo, I filed a claim with my bank, informing them of these details and letting them know that the item was “damaged or not as described”, the only option they provided that made sense, which in this case was the latter. As a result, I was issued a refund as a chargeback. However, I received an email from their customer service rep Am**a this morning, accusing me of lying and telling the bank that that my item was damaged and she proceeded to threaten me, stating that they’d be turning me into local fraud agencies to, “protect other small businesses”, which is laughable. Screen shots are readily available from our email correspondence and my bank.\n\nI’m completely appalled by this company. Especially given the fact that the quality of their items are PISS POOR. If I wanted thin, mesh dresses, I’d shop at SHEIN.\n\nI do not take lightly to threats and do not appreciate a small business with a struggling brand, customer service team, and reputation sending me snarky and threatening emails. No class, much like the quality of their clothing. I was very excited to shop with this brand, but clearly there’s still much development to be done within this business.\n\nPlease be advised that you never know who your customers are or what they’re capable of. Besides, according to social media reviews, your practices are troubling to many outside of myself and your customer service team is notoriously unprofessional. I may add my own reviews on social media as well, but I will also gladly follow this up in court.\n\nNow waiting for another rude email response from their silly rep and their weak attempt at a professional response to this review.\n\nIn response to BBXbrands response below: all the details provided here are the same as the details provided via email and you know this. Playing dumb is fitting but please don’t play coy. The quality of this piece is so bad, I’m considering dropping it at my local goodwill. I would’ve willingly provided the same feedback to your customer service rep. However, your customer service rep did not request or make inquiry into why I was seeking out a return. Instead, they simply notified me that the return window was closing in two days and that even if I sent my return, it wouldn’t get there in time to be refunded. Which in my opinion is a shady business practice for an international customer, nor is a reason for return required under your policy. Even the item being free would be too expensive. Again, the lack of accountability, professionalism, and tact is telling.",
    "date": "21 November 2024",
    "link": "https://uk.trustpilot.com/reviews/673f3e8f3a8a672c5e05e6da",
    "rating": 1,
    "sentiment_score": -0.01521043771043771,
    "sentiment_label": "neutral",
    "issue_category": "service_issue, product_issue, expectation, delivery_issue",
    "matched_keywords": "rude, waiting, refund, return, fit"
  },
  {
    "": 14,
    "customer name": "Lateipha",
    "review": "In my years of receiving customer service this company has delivered the worst I’ve ever received.\n\nStill in shock but I must say, order with faith and pray nothing goes wrong from whilst your order is being processed through to delivery.\n\nOrdered a Sheer black dress that came with a small tear which would likely be an accident during packaging. The material of the dress is very delicate.\n\nI emailed the company and sent photos they requested.\n\nThe company inform me that they have checked CCTV and QR information and this black dress was sent without scratches.\n\nThey were 100% sure of this I asked for evidence of this information.\n\nI infact reassured them that I loved the dress and would prefer an exchange.\n\nThey took no accountability and was willing to argue back and forth to assure me that an exchange or return will not be accepted.\n\nThe person behind customer service is argumentative and perhaps need a course to be taken on management & customer service.\n\nNo proof or evidence was provided and in fact they didn’t respond to my email.\n\nI’m in shock and hope that they will see this review and take action with their customer service delivery.\n\nI rate -5!\n\nTerrible",
    "date": "28 October 2024",
    "link": "https://uk.trustpilot.com/reviews/671f843c4f2a0d195ca4a52a",
    "rating": 1,
    "sentiment_score": -0.15322222222222223,
    "sentiment_label": "negative",
    "issue_category": "service_issue, expectation",
    "matched_keywords": "exchange, return, didn’t respond"
  },
  {
    "": 15,
    "customer name": "Sils",
    "review": "Been ordeing from bbx for some years now. My most recent purchase was for the Kesh 2 piece in mint for mu holdiay. It was perfect. Loved it and so did eveyone else!",
    "date": "22 August 2024",
    "link": "https://uk.trustpilot.com/reviews/66c8c320e9540609a979e1b8",
    "rating": 5,
    "sentiment_score": 0.59375,
    "sentiment_label": "positive",
    "issue_category": "uncategorized",
    "matched_keywords": "none"
  },
  {
    "": 16,
    "customer name": "B",
    "review": "I was looking for my birthday dress for a long time. After having being let down by another brand, I found a dress I loved with BBXBRAND. It wasn’t actually available as it was on pre order and had a lead time but as my birthday was approaching I couldn’t get it.\n\nI reached out to the team via email just to check if it would arrive on time but they told me it wouldn’t be here on time so I opted for another dress which was my second choice.\n\nIt arrived very quickly. Still loved it even though it was my second option.",
    "date": "04 August 2024",
    "link": "https://uk.trustpilot.com/reviews/66b4ed59983fb10588b17bec",
    "rating": 4,
    "sentiment_score": 0.22530864197530864,
    "sentiment_label": "positive",
    "issue_category": "positive_experience",
    "matched_keywords": "quick"
  },
  {
    "": 17,
    "customer name": "Elisha",
    "review": "Clothes are luxury quality and customer service is 10/10. Retuned a few items before and never had any issues was a really quick turn around. Love the clothes and literally make you feel your best and the amount of compliments is ridiculous!",
    "date": "05 May 2024",
    "link": "https://uk.trustpilot.com/reviews/66b135cecc157a9d8563c8db",
    "rating": 5,
    "sentiment_score": 0.24333333333333335,
    "sentiment_label": "positive",
    "issue_category": "positive_experience",
    "matched_keywords": "quick"
  },
  {
    "": 18,
    "customer name": "Anu",
    "review": "Firstly, delivery time - QUICK.\n\nSecondly the material and the quality of these dresses are second to none. I ordered the orange mini for my birthday and the way it sculpts you and boosts your confidence.\nThe pieces are so unique and versatile. From the modest pieces to everything. Will definitely be returning. Thank you for making me feel my best for my birthday 🧡🧡🧡🧡",
    "date": "01 August 2024",
    "link": "https://uk.trustpilot.com/reviews/66b10ec047fae5b7c2cc8128",
    "rating": 5,
    "sentiment_score": 0.2572916666666667,
    "sentiment_label": "positive",
    "issue_category": "positive_experience, expectation",
    "matched_keywords": "return, quick, thank you"
  },
  {
    "": 19,
    "customer name": "Ash",
    "review": "Just want to say WOW. Bought a lovely pink long dress that’s made with these petal leaves at the bottom for my sister in laws brothers wedding. It was stunninggggg! It was a little see through but I wore pink underwear and it was fine. Got so many compliments on it. Fabric was also stunning with stretch. Can’t wait for my second purchase",
    "date": "02 August 2024",
    "link": "https://uk.trustpilot.com/reviews/66ae3e458c931b5c943493f2",
    "rating": 5,
    "sentiment_score": 0.15666666666666668,
    "sentiment_label": "positive",
    "issue_category": "uncategorized",
    "matched_keywords": "none"
  },
  {
    "": 20,
    "customer name": "Bobbie Nicholson",
    "review": "Do not buy from this company. BBX Brand do a great job of marketing and advertising their products, thats a fact. But their dresses are far from worth the money you pay for them. When I received my dress it smelt horrible, the sizing was awful, the material is cheap, the stitching is awful and it was just a crazy experience from start to now.\n\nAs an ONLINE retailer, UK consumer law overwrites their policies as they are an online retailer, if there is an issue with their products, especially when they are not as advertised. I sent back 2 dresses which were of awful quality and not as described and they are refusing (going against the LAW) to refund me. Sent me a voucher i’ll never ever use the whole while i’m breathing! They love to argue their case in email exchanges, with their sarcastic tone.. and even go to lengths of calling you by a different name and putting kisses at the end of their emails… sooooo sarcastic lol!\n\nTheir customer service skills are far from professional, and whoever is advising them on their policies clearly hasn’t done their research on UK law.\n\nPlease make sure, if you do purchase, to use Paypal or Klarna to cover you. As the grief you get from these uneducated individuals is actually tiresome and boring and very repetitive. No doubt some one will comment with a very sarcastic reply on here (queue the drumroll). I’m just spreading awareness. Do your research first, but I highly discourage anyone from buying from this awful brand.\n\nLuckily I posted this to social media and managed to save a friend from working with them for their marketing and sales side and also save girls from eyeing up their website. They really are awful.",
    "date": "31 July 2024",
    "link": "https://uk.trustpilot.com/reviews/66aa9934028fc06d168e26a5",
    "rating": 1,
    "sentiment_score": -0.11419191919191918,
    "sentiment_label": "negative",
    "issue_category": "product_issue, expectation, positive_experience",
    "matched_keywords": "refund, great, exchange, sizing"
  },
  {
    "": 21,
    "customer name": "Chloe Jade",
    "review": "Ive had a terrible experience with this company when ordering a dress for my baby shower. There was only a size 12 available, while I usually wear a size 10. I contacted customer service to ask about the lead time and if I could return the dress if it was too big. Knowing exactly which dress I was interested in, they assured me it was returnable. Based on this, I placed the order, thinking I could exchange it for a different size or get my money back if needed.\n\nA few days later, I became concerned after reading reviews on Trustpilot and emailed the company again to confirm their return policy. They then told me the dress was a pre-order item and non-returnable because it was made to order. This made no sense since I couldn't even order a size 10 in the first place. If it were truly made to order, I should have been able to choose any size.\n\nI requested to cancel the order, as it had not yet shipped, but was told I could only get store credit and no refund. When I asked about exchanging the dress, they said I would need to buy another dress and would only get store credit for the original dress, effectively costing me double the price.\n\nIn their last email to me on Monday, they told me I needed to let them know what I wanted to do as the dress was due to ship that day. I replied in a couple of hours to say I will have to keep the dress as clearly I have no other option without being out of pocket. I have received no response and it is now Friday, clearly the dress was never ready to ship.\n\nThis entire experience has been incredibly frustrating and upsetting and now I’m getting no response from them.\n\nDo not buy from this company. Their policies are unreasonable, and their customer service is appalling",
    "date": "26 July 2024",
    "link": "https://uk.trustpilot.com/reviews/66a3cdd70920949b3dc911e0",
    "rating": 1,
    "sentiment_score": 0.017129629629629627,
    "sentiment_label": "neutral",
    "issue_category": "service_issue, product_issue, expectation",
    "matched_keywords": "exchange, too big, no response, refund, return"
  },
  {
    "": 22,
    "customer name": "Maddisongregoryx",
    "review": "The BEST dresses for events/ birthdays - I always feel extra special whenever I’m wearing this brand and it fits soooo good!",
    "date": "28 June 2024",
    "link": "https://uk.trustpilot.com/reviews/667ef10dc66ac3c9ef7a7136",
    "rating": 5,
    "sentiment_score": 0.5580357142857143,
    "sentiment_label": "positive",
    "issue_category": "product_issue",
    "matched_keywords": "fit"
  },
  {
    "": 23,
    "customer name": "Bridget M",
    "review": "Finally took the plunge to order my 30th bday dress from here after deliberating for months. Unfortunately the dress was awful - the sizing and fit is just off! And the dress looked nothing like the image; if felt much cheaper quality than pictured or priced. I decided to return it immediately to get my refund but to my surprise they don’t offer refunds on any items bought with a discount code (codes which they send to your inbox as a subscriber to the store). This is not only unfair on a customer but also against the consumer rights acts legislation for online purchase. From speaking with the Trading Standards, this has been escalated to be resolved however it’s a shame a brand would put so many loopholes to keep customer funds. A reputable brand would have no issue just issuing refunds - unless you anticipate a lot of complaints 😊\n\nThe one pro is how responsive the customer service team are to come back to queries. I don’t bought if I wanted to exchange my dress they would be able to assist. Unfortunately the quality has put me right off and now stuck in back and forth with them to get my refund back, as legislation permits.",
    "date": "31 May 2024",
    "link": "https://uk.trustpilot.com/reviews/66638f60ec2ecdf76c39cb79",
    "rating": 1,
    "sentiment_score": -0.0009523809523809564,
    "sentiment_label": "neutral",
    "issue_category": "product_issue, expectation, positive_experience",
    "matched_keywords": "resolved, exchange, refund, return, sizing, fit"
  },
  {
    "": 24,
    "customer name": "Phyl",
    "review": "I absolutely love BBX Brand! Not only do they offer unique, one-of-a-kind pieces, but their customer service is also top-notch. The BBX Brand team provides an unparalleled shopping experience, ensuring quick responses to any queries and a fast shipping process. They truly go above and beyond to provide the best service possible. I am a customer for life!",
    "date": "22 April 2024",
    "link": "https://uk.trustpilot.com/reviews/662f8b941e7c2113e2f7a810",
    "rating": 5,
    "sentiment_score": 0.3925925925925926,
    "sentiment_label": "positive",
    "issue_category": "positive_experience",
    "matched_keywords": "quick, fast"
  },
  {
    "": 25,
    "customer name": "Martial",
    "review": "Guys do not let your girlfriend order something on this website. You’re gonna have bad days because of what the extra cost. They don’t tell to customers that they will pay 80€ (only to deliver) for a dress that is about 150 €.",
    "date": "02 March 2024",
    "link": "https://uk.trustpilot.com/reviews/65e3ad63a36fb9e0ca4fb26d",
    "rating": 1,
    "sentiment_score": -0.23333333333333328,
    "sentiment_label": "negative",
    "issue_category": "uncategorized",
    "matched_keywords": "none"
  },
  {
    "": 26,
    "customer name": "Sonia",
    "review": "Love love love my dress! I emailed to ask if I could pay for ndd to which they said they don’t offer that service but their shipping is fairly quick (1-2 days). They didn’t lie! I received a well presented package and a BEAUTIFUL dress the next day. The material is amazing and hugs you in the right places lol it’s like really nice shape-wear. Definitely recommend!!!",
    "date": "05 February 2024",
    "link": "https://uk.trustpilot.com/reviews/65c36cf41d11165c63dc0a47",
    "rating": 5,
    "sentiment_score": 0.47067099567099563,
    "sentiment_label": "positive",
    "issue_category": "positive_experience",
    "matched_keywords": "quick, amazing"
  },
  {
    "": 27,
    "customer name": "KA",
    "review": "I’ve been shopping with you from the start and people never understood why I used to shout about BBX so much 😂 it’s the quality and designs for me ! The team also were very helpful and kind with replacing an item that was damaged. ❤️",
    "date": "31 January 2024",
    "link": "https://uk.trustpilot.com/reviews/65ba8f0d2f8728ba2499a41f",
    "rating": 5,
    "sentiment_score": 0.35000000000000003,
    "sentiment_label": "positive",
    "issue_category": "positive_experience",
    "matched_keywords": "helpful"
  },
  {
    "": 28,
    "customer name": "Shamara Lacey",
    "review": "My experience with this brand has been such a great process. I received the most amazing dress. By far a dress that I’ve had most compliments on ever. I ordered a dress for my sisters birthday meal and it came just in time. This is a small niche business that deserves all the support for thier amaging unique items.",
    "date": "15 January 2024",
    "link": "https://uk.trustpilot.com/reviews/65a686cbade2acd13deff6b0",
    "rating": 5,
    "sentiment_score": 0.328125,
    "sentiment_label": "positive",
    "issue_category": "positive_experience",
    "matched_keywords": "great, amazing"
  },
  {
    "": 29,
    "customer name": "Kamille Saint",
    "review": "Ordered a dress for my birthday as I had been let down by another company and I guess everything happens for a reason as honestly I was in love with the dress. It fit me perfectly. The length was a little long for me personally but was fine with heels. It came the next day which was super super fast.",
    "date": "13 January 2024",
    "link": "https://uk.trustpilot.com/reviews/65a2e4b7eceea5d41567b342",
    "rating": 5,
    "sentiment_score": 0.26079059829059836,
    "sentiment_label": "positive",
    "issue_category": "product_issue, positive_experience",
    "matched_keywords": "fast, fit"
  },
  {
    "": 30,
    "customer name": "Olivia",
    "review": "The item i got didn't fit, AT ALL, sizing was way off what i was used to (bummer as it was an amazing dress) BUT when i messaged customer service, they offered a different size and were willing to ship it to me before they even got my return back! I didn't take them up and just opted for a refund instead but love the way they handled it. Definitely recommend if you know your size with them. The dresses are beautiful!",
    "date": "05 January 2024",
    "link": "https://uk.trustpilot.com/reviews/65a11bfe5aa380dcc0bbefd7",
    "rating": 4,
    "sentiment_score": 0.34375,
    "sentiment_label": "positive",
    "issue_category": "product_issue, expectation, positive_experience",
    "matched_keywords": "refund, return, sizing, amazing, fit"
  },
  {
    "": 31,
    "customer name": "J. S.",
    "review": "The owner makes everything look like it’s all that but in reality the products are just of basic quality and cannot tell you how bad the sizing is! Been waiting for a pre-order for over two months and if you return it you’ll get a store credit from which they’ll deduct the shipping fee which you paid for and then you’ll have to pay more from your pocket to return it! Awful, awful experience and service; no wonder she doesn’t allow customers to review the items directly on the website! I’m stuck now with a store credit, waiting to purchase something someday I might like! To not mention the overly priced items that you can get for less elsewhere. Stop putting your money in her pocket for her to live in luxury and you won’t be wearing that outfit again! You don’t get what you pay for, simple.",
    "date": "15 June 2023",
    "link": "https://uk.trustpilot.com/reviews/65003ed3ca4e2c3089ad8fe3",
    "rating": 1,
    "sentiment_score": -0.23221801346801346,
    "sentiment_label": "negative",
    "issue_category": "delivery_issue, product_issue, expectation",
    "matched_keywords": "waiting, return, sizing, fit"
  },
  {
    "": 32,
    "customer name": "Raven",
    "review": "If you’re ordering from the US beware! You have to pay $32 for express DHL shipping then if you return and use UPS it’s $200+! This company will not give you a simple DHL code to return their items so even if you don’t want it you’re literally wasting your money. I got my size according to the size chart and it was still too big. Plus the quality isn’t worth the price. I have $50 items that feel the same way.",
    "date": "07 April 2023",
    "link": "https://uk.trustpilot.com/reviews/64d7a5d925c68d53ef1b199a",
    "rating": 1,
    "sentiment_score": 0.075,
    "sentiment_label": "neutral",
    "issue_category": "product_issue, expectation",
    "matched_keywords": "return, too big"
  },
  {
    "": 33,
    "customer name": "Sonia",
    "review": "Awful service and complained about me using a welcome discount code more than once instead of investigating the issue with my order. 5 weeks after making an order I asked them about the status and instead of trying to assist with the product status they said I was banned for using the discount code again. Just admit you were out of stock instead of cancelling my order after 6 weeks. Do not recommend buying from them, save your money",
    "date": "13 April 2023",
    "link": "https://uk.trustpilot.com/reviews/643862699c418c3a80f337dd",
    "rating": 1,
    "sentiment_score": 0,
    "sentiment_label": "neutral",
    "issue_category": "uncategorized",
    "matched_keywords": "none"
  },
  {
    "": 34,
    "customer name": "Christie Antoszczak",
    "review": "Terrible company to deal with. US Customers don’t bother. The quality is terrible not worth the price and the return policy is a joke. You pay for the shipping which is $60+ and then they refuse to pick up the package. I had to go to my bank to receive a refund. It’s not worth it.",
    "date": "15 February 2023",
    "link": "https://uk.trustpilot.com/reviews/63ee24db745e480021a71a24",
    "rating": 1,
    "sentiment_score": -0.575,
    "sentiment_label": "negative",
    "issue_category": "expectation",
    "matched_keywords": "refund, return"
  },
  {
    "": 35,
    "customer name": "Fayobi fadojutimi",
    "review": "They are one of the only retail establishments that do not give refunds for sale items. They claim to only give credit notes for sale items that are returned, yet, it’s been over a week that I returned 2 items and the full price has been refunded but I am still waiting for the credit note. This is a credit note that was not issued in due time for their new drop of stock ( their stuff sells out almost immediately) I spent over £300 on their new drop and was told that I can not off set my credit note that is pending, although they understood my point, so only God knows how I will ever spend a credit note since there is never any stock available. I have had 3 emails stating they are looking into my refund, yet still no resolution, please stay away from this brand, there is no customer service no and they dnt care about their customers , they just want to take money.",
    "date": "04 May 2022",
    "link": "https://uk.trustpilot.com/reviews/62729072166eb7ecbf3cddbb",
    "rating": 1,
    "sentiment_score": 0.08863636363636364,
    "sentiment_label": "neutral",
    "issue_category": "delivery_issue, expectation",
    "matched_keywords": "refund, return, waiting"
  }
]